Revit 2027 API
BuiltInFailures.MEPCalculationFailures.NetworkEnergyEquationNotConverge Property
 The energy calculation could not be performed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NetworkEnergyEquationNotConverge { get; }
Public Shared ReadOnly Property NetworkEnergyEquationNotConverge As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NetworkEnergyEquationNotConverge {
	FailureDefinitionId^ get ();
}
static member NetworkEnergyEquationNotConverge : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace